# DimensionEqualityLabelFormatting Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
DimensionEqualityLabelFormatting Properties
DimensionEqualityLabelFormatting Class See Also
---
The DimensionEqualityLabelFormatting type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| LabelType | The parameter value to be shown. |
| LeadingSpaces | The number of spaces to include before the parameter value. |
| Prefix | The prefix to include before the parameter value. |
| Suffix | The suffix to include after the parameter value. |

# See Also
DimensionEqualityLabelFormatting Class
Autodesk.Revit.DB Namespace